app/Http/Controllers/Auth/RegisteredUserController.php

    public function store(Request $request): RedirectResponse
{
    $request->validate([
        'name' => 'required|string|max:255',
        'email' => 'required|string|lowercase|email|max:255|unique:'.User::class,
        'nik' => 'required|string|digits:16|unique:'.User::class, // Tambahkan validasi
        'phone' => 'required|string|max:15', // Tambahkan validasi
        'address' => 'required|string|max:255', // Tambahkan validasi
        'password' => ['required', 'confirmed', Rules\Password::defaults()],
    ]);

    $user = User::create([
        'name' => $request->name,
        'email' => $request->email,
        'nik' => $request->nik, // Tambahkan data
        'phone' => $request->phone, // Tambahkan data
        'address' => $request->address, // Tambahkan data
        'password' => Hash::make($request->password),
    ]);
---
insert into `users` (`name`, `email`, `nik`, `phone`, `address`, `password`, `updated_at`, `created_at`) values ('apakah', 'wargabaru@example.com', '1234567250123456', '089205347344', 'Madeira, Portugal', '$2y$12$527Vb6nhGmZgVDFuWQpNT.T.KKdKB8RcFSzynxBm2a7qWTn7qWuRa', '2025-09-22 10:43:04', '2025-09-22 10:43:04')