app/Services/PengajuanSuratService.php

select `id`, `nama_surat`, `syarat` from `jenis_surats`
---
    public function getIndexData(User $user): array
    {
        $pengajuanAktif = $this->processLampiranUrlsCollection(
            $this->repository->getActivePengajuanByUser($user->id)
        );

        $riwayatPengajuan = $this->processLampiranUrlsCollection(
            $this->repository->getRiwayatPengajuanByUser($user->id)
        );

        return [
            'jenisSuratTersedia' => JenisSurat::get(['id', 'nama_surat', 'syarat']),
            'pengajuanAktif' => $pengajuanAktif,
            'riwayatPengajuan' => $riwayatPengajuan,
            'isProfileComplete' => $this->isProfileComplete($user),
        ];