app/Services/ProsesPengajuanService.php

            function ($attribute, $value, $fail) use ($pengajuan) {
                if (!empty($value)) {
                    $exists = \App\Models\PengajuanSurat::where('nomor_surat', $value)
                        ->where('id', '!=', $pengajuan->id)
                        ->exists();
---
select exists(select * from `pengajuan_surats` where `nomor_surat` = '017/DS/XII/2024' and `id` != 12) as `exists`