app/Http/Requests/StorePengajuanSuratRequest.php

    public function rules()
    {
        $rules = [
            'jenis_surat_id' => 'required|exists:jenis_surats,id',
            'lampiran' => 'nullable|array', // Izinkan lampiran kosong jika tidak ada syarat
        ];

        // Temukan jenis surat untuk mendapatkan syaratnya
        $jenisSurat = JenisSurat::find($this->input('jenis_surat_id'));
---
select * from `jenis_surats` where `jenis_surats`.`id` = '1' limit 1