app/Http/Controllers/DashboardController.php

    public function index()
    {
        $user = Auth::user();

        $submissions = PengajuanSurat::where('user_id', $user->id)
            ->with('jenisSurat:id,nama_surat')
            ->orderBy('created_at', 'desc')
            ->get();
---
select * from `pengajuan_surats` where `user_id` = 11 order by `created_at` desc