app/Http/Controllers/LandingPageController.php

    private function getStatistics()
    {
        // Mengambil jumlah warga terdaftar dari database
        $totalWarga = User::where('role', 'warga')->count();

        // Mengambil jumlah surat terbit (status 'selesai') dari database
        $suratTerbit = PengajuanSurat::where('status', 'selesai')->count();
---
select count(*) as aggregate from `users` where `role` = 'warga' and `users`.`deleted_at` is null
select count(*) as aggregate from `pengajuan_surats` where `status` = 'selesai'