app/Http/Controllers/PengaduanController.php

    public function adminIndex(Request $request)
    {
        $query = Pengaduan::with(['user:id,name,nik', 'admin:id,name']);

        // Filter berdasarkan status
        if ($request->filled('status')) {
            $query->where('status', $request->status);
        }

        // Filter berdasarkan prioritas
        if ($request->filled('prioritas')) {
            $query->where('prioritas', $request->prioritas);
        }

        // Filter berdasarkan kategori
        if ($request->filled('kategori')) {
            $query->where('kategori', 'like', '%' . $request->kategori . '%');
        }

        // Search berdasarkan judul atau deskripsi
        if ($request->filled('search')) {
            $query->where(function (Builder $q) use ($request) {
                $q->where('judul', 'like', '%' . $request->search . '%')
                  ->orWhere('deskripsi', 'like', '%' . $request->search . '%');
            });
        }

        $pengaduan = $query->latest()
            ->paginate(10)
            ->withQueryString()
            ->through(function ($item) {
                // PENTING: Tambahkan URL untuk kedua foto
                $item->foto_bukti_url = $item->foto_bukti
                    ? Storage::url($item->foto_bukti)
                    : null;

                $item->foto_proses_url = $item->foto_proses
                    ? Storage::url($item->foto_proses)
                    : null;

                return $item;
            });
---
select * from `pengaduan` order by `created_at` desc limit 10 offset 0
select `id`, `name`, `nik` from `users` where `users`.`id` in (8, 9, 10) and `users`.`deleted_at` is null
select count(*) as aggregate from `pengaduan`

        // Statistik untuk dashboard
        $statistik = [
            'total' => Pengaduan::count(),
            'dikirim' => Pengaduan::where('status', 'Dikirim')->count(),
            'diterima' => Pengaduan::where('status', 'Diterima')->count(),
            'diproses' => Pengaduan::where('status', 'Diproses')->count(),
            'selesai' => Pengaduan::where('status', 'Selesai')->count(),
---
select count(*) as aggregate from `pengaduan` where `status` = 'Dikirim'
select count(*) as aggregate from `pengaduan` where `status` = 'Diterima'
select count(*) as aggregate from `pengaduan` where `status` = 'Diproses'
select count(*) as aggregate from `pengaduan` where `status` = 'Selesai'

    public function adminRiwayat(Request $request)
    {
        $query = Pengaduan::with(['user:id,name,nik', 'admin:id,name'])
                          ->where('status', 'Selesai');

        // Filter berdasarkan kategori
        if ($request->filled('kategori')) {
            $query->where('kategori', 'like', '%' . $request->kategori . '%');
        }

        // Search berdasarkan judul atau deskripsi
        if ($request->filled('search')) {
            $query->where(function (Builder $q) use ($request) {
                $q->where('judul', 'like', '%' . $request->search . '%')
                  ->orWhere('deskripsi', 'like', '%' . $request->search . '%');
            });
        }

        $pengaduan = $query->latest()
            ->paginate(10)
            ->withQueryString()
            ->through(function ($item) {
                return $this->attachPhotoUrlsToSingle($item);
            });
---
select count(*) as aggregate from `pengaduan` where `status` = 'Selesai'