app/Http/Controllers/WargaPengaduanController.php

    public function index()
    {
        $user = Auth::user();

        $allPengaduan = Pengaduan::where('user_id', $user->id)
            ->with(['admin:id,name'])
            ->latest()
            ->get();
---
select * from `pengaduan` where `user_id` = 8 order by `created_at` desc

    public function store(Request $request)
    {
        $validated = $request->validate([
            'judul' => 'required|string|max:255',
            'deskripsi' => 'required|string',
            'foto_bukti' => 'required|image|mimes:jpeg,png,jpg|max:2048',
            'alamat' => 'nullable|string|max:255',
            'latitude' => 'nullable|numeric',
            'longitude' => 'nullable|numeric',
            'kategori' => 'nullable|string|max:100',
        ]);

         $pathBukti = null; // Inisialisasi path
    if ($request->hasFile('foto_bukti')) {
        // [UBAH INI] Gunakan dua argumen untuk path dan disk
        $pathBukti = $request->file('foto_bukti')->store('pengaduan/bukti', 'public');
    }

    Pengaduan::create([
        'user_id' => Auth::id(),
        'judul' => $validated['judul'],
        'deskripsi' => $validated['deskripsi'],
        'foto_bukti' => $pathBukti, // Simpan path yang sudah benar
            'alamat' => $validated['alamat'],
            'latitude' => $validated['latitude'],
            'longitude' => $validated['longitude'],
            'kategori' => $validated['kategori'],
        ]);
---
insert into `pengaduan` (`user_id`, `judul`, `deskripsi`, `foto_bukti`, `alamat`, `latitude`, `longitude`, `kategori`, `updated_at`, `created_at`) values (11, 'air selokan macet', 'ada batang tikus terjepit', 'public/pengaduan/bukti/hJltP1DADejCfwyZIhNmHi4CRo7weKvtyQFlF3xV.jpg', 'di depan gang masjid', '-31.2141661', '80.166846', 'kebersihan', '2025-09-22 10:44:56', '2025-09-22 10:44:56')