app/Http/Controllers/Admin/AdminPengaduanController.php

        // Load relasi untuk response
        $pengaduan->load(['user:id,name,nik', 'admin:id,name']);

        return redirect()->back()->with([
            'success' => 'Detail pengaduan berhasil diperbarui.',
            'updatedPengaduan' => $pengaduan
        ]);
---
select `id`, `name`, `nik` from `users` where `users`.`id` in (8) and `users`.`deleted_at` is null