app/Http/Controllers/Admin/AdminPengaduanController.php

select * from `pengaduan` order by `created_at` desc limit 10 offset 0
select `id`, `name`, `nik`, `profile_photo_path` from `users` where `users`.`id` in (8, 9, 10, 11) and `users`.`deleted_at` is null
select count(*) as aggregate from `pengaduan`
---
    public function index(Request $request)
    {
        $query = Pengaduan::with(['user:id,name,nik,profile_photo_path', 'admin:id,name']);

        // Filter berdasarkan status
        if ($request->filled('status')) {
            $query->where('status', $request->status);
        }

        // Filter berdasarkan prioritas
        if ($request->filled('prioritas')) {
            $query->where('prioritas', $request->prioritas);
        }

        // Filter berdasarkan kategori
        if ($request->filled('kategori')) {
            $query->where('kategori', 'like', '%' . $request->kategori . '%');
        }

        // Search berdasarkan judul atau deskripsi
        if ($request->filled('search')) {
            $query->where(function (Builder $q) use ($request) {
                $q->where('judul', 'like', '%' . $request->search . '%')
                  ->orWhere('deskripsi', 'like', '%' . $request->search . '%');
            });
        }

        $pengaduan = $query->latest()
            ->paginate(10)
            ->withQueryString();

select count(*) as aggregate from `pengaduan` where `status` = 'Dikirim'
select count(*) as aggregate from `pengaduan` where `status` = 'Diterima'
select count(*) as aggregate from `pengaduan` where `status` = 'Diproses'
select count(*) as aggregate from `pengaduan` where `status` = 'Selesai'
---
        // Statistik untuk dashboard
        $statistik = [
            'total' => Pengaduan::count(),
            'dikirim' => Pengaduan::where('status', 'Dikirim')->count(),
            'diterima' => Pengaduan::where('status', 'Diterima')->count(),
            'diproses' => Pengaduan::where('status', 'Diproses')->count(),
            'selesai' => Pengaduan::where('status', 'Selesai')->count(),

select count(*) as aggregate from `pengaduan` where `status` = 'Selesai'
---
    public function riwayat(Request $request)
    {
        $query = Pengaduan::with(['user:id,name,nik', 'admin:id,name'])
                          ->where('status', 'Selesai');

        // Filter berdasarkan kategori
        if ($request->filled('kategori')) {
            $query->where('kategori', 'like', '%' . $request->kategori . '%');
        }

        // Search berdasarkan judul atau deskripsi
        if ($request->filled('search')) {
            $query->where(function (Builder $q) use ($request) {
                $q->where('judul', 'like', '%' . $request->search . '%')
                  ->orWhere('deskripsi', 'like', '%' . $request->search . '%');
            });
        }

        $pengaduan = $query->latest()
            ->paginate(10)
            ->withQueryString();

update `pengaduan` set `foto_proses` = null, `keterangan_admin` = 'oke', `pengaduan`.`updated_at` = '2025-09-22 11:43:02' where `id` = 8
select `id`, `name`, `nik` from `users` where `users`.`id` in (8) and `users`.`deleted_at` is null
---
    public function updateDetails(Request $request, Pengaduan $pengaduan)
    {
        $validated = $request->validate([
            'status' => 'required|in:Dikirim,Diterima,Diproses,Selesai',
            'prioritas' => 'required|in:Rendah,Sedang,Tinggi,Darurat',
            'keterangan_admin' => 'nullable|string',
            'estimasi_selesai' => 'nullable|date',
            'foto_proses' => 'nullable|image|mimes:jpeg,png,jpg|max:2048',
        ]);

        // Update admin_id dengan user yang sedang login
        $validated['admin_id'] = Auth::id();

        // Handle file upload foto proses
        if ($request->hasFile('foto_proses')) {
            // Hapus foto lama jika ada
            if ($pengaduan->foto_proses && Storage::exists($pengaduan->foto_proses)) {
                Storage::delete($pengaduan->foto_proses);
            }
            // Simpan foto baru
            $pathProses = $request->file('foto_proses')->store('public/pengaduan/proses');
            $validated['foto_proses'] = $pathProses;
        }

        $pengaduan->update($validated);

        // Load relasi untuk response
        $pengaduan->load(['user:id,name,nik', 'admin:id,name']);

update `pengaduan` set `foto_proses` = 'public/pengaduan/proses/DEDdYTKDxaWYFtboG9lRz6AX7LC5TX04PcRY4xOa.png', `admin_id` = 8, `pengaduan`.`updated_at` = '2025-09-22 11:39:24' where `id` = 8
---
    public function uploadProses(Request $request, Pengaduan $pengaduan)
    {
        $request->validate([
            'foto_proses' => 'required|image|mimes:jpeg,png,jpg|max:2048',
        ]);

        // Pastikan direktori ada
        Storage::makeDirectory('public/pengaduan/proses');

        // Hapus foto lama jika ada
        if ($pengaduan->foto_proses && Storage::exists($pengaduan->foto_proses)) {
            Storage::delete($pengaduan->foto_proses);
        }

        // Upload foto baru
        $pathProses = $request->file('foto_proses')->store('public/pengaduan/proses');

        $pengaduan->update([
            'foto_proses' => $pathProses,
            'admin_id' => Auth::id(),
        ]);