app/Http/Controllers/Admin/DashboardController.php

   public function index()
{
    // --- PERUBAHAN DIMULAI DI SINI ---

    // Mengambil semua hitungan status dalam satu query untuk efisiensi
    $statusCounts = PengajuanSurat::select('status', DB::raw('count(*) as total'))
        ->groupBy('status')
        ->pluck('total', 'status');

    // Menyiapkan nilai default 0 jika status tidak ada
    $pendingCount = $statusCounts->get('pending', 0);
    $diprosesCount = $statusCounts->get('diproses', 0);
    $selesaiCount = $statusCounts->get('selesai', 0);
    $ditolakCount = $statusCounts->get('ditolak', 0);

    // Mengambil data untuk kartu statistik dengan struktur baru
    $statistics = [
        'totalUsers' => User::where('role', 'warga')->count(),
        'letterTypes' => JenisSurat::count(),
        'totalPerangkatDesa' => PerangkatDesa::count(),

        // Data untuk kartu "Belum Diproses"
        'unprocessedCount' => $pendingCount + $diprosesCount,
        'pendingCount' => $pendingCount,
        'onProcessCount' => $diprosesCount,

        // Data untuk kartu "Telah Diproses"
        'processedCount' => $selesaiCount + $ditolakCount,
        'completedCount' => $selesaiCount,
        'rejectedCount' => $ditolakCount,
    ];
---
select `status`, count(*) as total from `pengajuan_surats` group by `status`
select count(*) as aggregate from `users` where `role` = 'warga' and `users`.`deleted_at` is null
select count(*) as aggregate from `jenis_surats`
select count(*) as aggregate from `perangkat_desa`



    // Mengambil 10 aktivitas pengajuan surat terbaru
    $recentActivities = PengajuanSurat::with(['user:id,name', 'jenisSurat:id,nama_surat'])
        ->latest()
        ->take(10)
        ->get();
---
select * from `pengajuan_surats` order by `created_at` desc limit 10
select `id`, `nama_surat` from `jenis_surats` where `jenis_surats`.`id` in (1)
select `id`, `name` from `users` where `users`.`id` in (8) and `users`.`deleted_at` is null

    private function getDailySubmissions()
    {
        $data = PengajuanSurat::select(
                DB::raw('DATE(created_at) as date'),
                DB::raw('COUNT(*) as total')
            )
            ->where('created_at', '>=', now()->subDays(30))
            ->groupBy('date')
            ->orderBy('date', 'asc')
            ->get();
---
select DATE(created_at) as date, COUNT(*) as total from `pengajuan_surats` where `created_at` >= '2025-08-23 00:17:16' group by `date` order by `date` asc

    private function getLetterTypeDistribution()
    {
        return PengajuanSurat::join('jenis_surats', 'pengajuan_surats.jenis_surat_id', '=', 'jenis_surats.id')
            ->selectRaw('jenis_surats.nama_surat, COUNT(*) as total')
            ->groupBy('jenis_surats.id', 'jenis_surats.nama_surat')
            ->orderBy('total', 'desc')
            ->limit(5) // Top 5 jenis surat
            ->get()
            ->mapWithKeys(function ($item) {
                return [$item->nama_surat => $item->total];
            });
---
select jenis_surats.nama_surat, COUNT(*) as total from `pengajuan_surats` inner join `jenis_surats` on `pengajuan_surats`.`jenis_surat_id` = `jenis_surats`.`id` group by `jenis_surats`.`id`, `jenis_surats`.`nama_surat` order by `total` desc limit 5