app/Http/Controllers/Admin/UserController.php

    public function index(): Response
    {
        $users = User::withTrashed()
            ->where('id', '!=', auth()->id())
            ->latest()
            ->get();
---
select * from `users` where `id` != 8 order by `created_at` desc