app/Repositories/PengajuanSuratRepository.php

    public function getActivePengajuanByUser(int $userId): Collection
    {
        return PengajuanSurat::where('user_id', $userId)
            ->with(['jenisSurat:id,nama_surat', 'user:id,name,email,nik,address'])
            ->whereIn('status', ['pending', 'diproses'])
            ->latest()
            ->get();
---
select * from `pengajuan_surats` where `user_id` = 8 and `status` in ('pending', 'diproses') order by `created_at` desc
select `id`, `nama_surat` from `jenis_surats` where `jenis_surats`.`id` in (1)
select `id`, `name`, `email`, `nik`, `address` from `users` where `users`.`id` in (8) and `users`.`deleted_at` is null

    public function getRiwayatPengajuanByUser(int $userId): Collection
    {
        return PengajuanSurat::where('user_id', $userId)
            ->with(['jenisSurat:id,nama_surat', 'user:id,name,email,nik,address'])
            ->whereIn('status', ['selesai', 'ditolak'])
            ->latest()
            ->get();
---
select * from `pengajuan_surats` where `user_id` = 8 and `status` in ('selesai', 'ditolak') order by `created_at` desc
select `id`, `nama_surat` from `jenis_surats` where `jenis_surats`.`id` in (1)
select `id`, `name`, `email`, `nik`, `address` from `users` where `users`.`id` in (8) and `users`.`deleted_at` is null

    public function create(array $data): PengajuanSurat
    {
        return PengajuanSurat::create($data);
---
insert into `pengajuan_surats` (`user_id`, `jenis_surat_id`, `status`, `lampiran`, `timeline`, `updated_at`, `created_at`) values (8, '1', 'pending', '{\"ktp\":{\"path\":\"lampiran_warga\\/8\\/xFYQxDDq9YqLVBoszMcVvn5MyfhLkcVUuZbaUoFs.pdf\",\"original_name\":\"Penerapan Grid Search dan Genetic Algorithm untuk Seleksi Fitur dan Optimasi Hiperparameter pada Model Random Forest dalam Memprediksi Diabetes.pdf\"},\"kartu_keluarga\":{\"path\":\"lampiran_warga\\/8\\/80zMa6pcdmDAQU67mAQT9meTCjwvSEGLVV4QdsYJ.pdf\",\"original_name\":\"Link Wordpress yang benar.pdf\"}}', '[{\"status\":\"pending\",\"message\":\"Pengajuan dibuat oleh warga.\",\"timestamp\":\"2025-09-22T00:20:30.225944Z\"}]', '2025-09-22 00:20:30', '2025-09-22 00:20:30')