app/Repositories/PerangkatDesaRepository.php

select * from `jabatan_desas` where `jabatan_desas`.`id` in (1, 2, 3, 7)
select * from `perangkat_desa` order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `perangkat_desa`
---
    public function getAllPaginated(int $perPage): LengthAwarePaginator
    {
        return PerangkatDesa::with('jabatanDesa')->latest()->paginate($perPage);

select * from `jabatan_desas` where `is_active` = 1 order by `urutan` asc
---
    public function getJabatanOptions(): Collection
    {
        return JabatanDesa::where('is_active', true)->orderBy('urutan')->get();

select * from `jabatan_desas` where `jabatan_desas`.`id` in (1, 2, 3, 7)
select * from `perangkat_desa` where `status_jabatan` = 'aktif'
---
    public function getActiveWithJabatan(): Collection
    {
        return PerangkatDesa::with('jabatanDesa')
            ->where('status_jabatan', 'aktif')
            ->get();