app/Repositories/ProfilDesaRepository.php

    public function getFirst(): ProfilDesa
    {
        return ProfilDesa::firstOrFail();
---
select * from `profil_desas` limit 1