app/Repositories/ProsesPengajuanRepository.php

    public function getPaginatedByStatus(array $statuses, Request $request): LengthAwarePaginator
    {
        $query = PengajuanSurat::whereIn('status', $statuses)
            ->with(['user:id,name,nik,profile_photo_path', 'jenisSurat:id,nama_surat']);

        $this->applyFilters($query, $request);

        $perPage = $request->get('per_page', 10);

        return $query->latest()->paginate($perPage)->withQueryString();
---
select * from `pengajuan_surats` where `status` in ('selesai', 'ditolak') order by `created_at` desc limit 10 offset 0
select `id`, `nama_surat` from `jenis_surats` where `jenis_surats`.`id` in (1)
select `id`, `name`, `nik`, `profile_photo_path` from `users` where `users`.`id` in (8) and `users`.`deleted_at` is null
select count(*) as aggregate from `pengajuan_surats` where `status` in ('selesai', 'ditolak')